# 1) input

# პირველი დავალება --- 
# მომხმარებელმა უნდა შემოიტანოს რიცხვი 1 - დან 1000 - მდე, თქვენი მიზანია, რომ გამოიცნოთ შემოტანილი რიცხვი, თუ სწორი იქნება დაპრინტეთ 'სწორია!', ხოლო თუ არასწორია, დაპრინტეთ ;არასწორია!'

# number = 149

# Random_number = int(input("enter random number below 1000: "))

# if Random_number > number:
#     print(False)

# if Random_number < number:
#     print(False)

# else:
#     print(True)



# მეორე დავალება ---

# დაწერეთ პროგრამა, რომელიც მოუწოდებს მომხმარებელს შეიყვანოს ნივთების რაოდენობა, რომლის შეძენაც სურს.
# დარწმუნდით, რომ მომხმარებელი შეიყვანს დადებითი რიცხვს.
# თითოეული ნივთისთვის, შესთავაზეთ მომხმარებელს შეიყვანოს ფასი.
# დარწმუნდით, რომ მომხმარებელი შეიყვანოს დადებითი რიცხვს პროდუქტის ფასისთვის.
# გამოთვალეთ და აჩვენეთ ყველა ელემენტის მთლიანი ღირებულება.

# item_quantity = int(input('amount of items you want: '))

# if item_quantity > 0:
#     price = int(input('Enter prices of items you want: '))

# if item_quantity < 0:
#     print(False)

# if price < 0:
#     print(False)

# else:
#     print(False)

# print(item_quantity + price)

# დაწერეთ პროგრამა, რომელიც მოუწოდებს მომხმარებელს შეიყვანოს წონა (კილოგრამებში) და სიმაღლე (მეტრებში). გამოთვალეთ სხეულის მასის ინდექსი (BMI) ფორმულის გამოყენებით: BMI = წონა / (სიმაღლე * სიმაღლე). გამოთვლილი BMI-დან გამომდინარე, მიაწოდეთ მომხმარებლის ჯანმრთელობის შეტყობინება: თუ BMI 18.5-ზე ნაკლებია, აჩვენეთ "Underweight". თუ BMI არის 18.5-დან 24.9-მდე,
# ჩვენება "ნორმალური წონა". თუ BMI არის 25-დან 29.9-მდე, აჩვენეთ "Overweight". თუ BMI არის 30 ან მეტი, აჩვენეთ "სიმსუქნე". აჩვენეთ გამოთვლილი BMI და ჯანმრთელობის შეტყობინება გამოყენებისთვის


# weight = int(input('Enter your weight in kilograms: '))
# height = int(input('Enter your height in metres: '))

# BMI = weight / height

# print(BMI)

# if BMI < 18.5:
#     print('Underweight')

# if BMI >= 18.5 < 24.9:
#     print('Normal weight')

# if BMI >= 25 < 29.9:
#     print('Overweight')

# if BMI >= 30:
#     print('Fat')


# 2) შედარებითი ოპერატორები

# გააკეთეთ 10 მაგალითი შედარებით ოპერატორებზე.


# print(10 < 11)
# print(56 < 64)
# print(22 > 21)
# print(88 < 89) 
# print(437 > 100)
# print(33 < 22)
# print(97 > 13)
# print(143 < 500)
# print(68 > 1)
# print(232 < 400)
# print(198 > 1)


# 3) ლოგიკური ოპერატორები


# პირველი დავალება ---
# დაწერეთ პროგრამა,  რათა შეამოწმოთ, აქვს თუ არა მომხმარებელს ფასდაკლების უფლება მისი ასაკისა და შესყიდვის მთლიანი თანხის მიხედვით. შესთავაზეთ მომხმარებელს შეიყვანოს მათი ასაკი და შესყიდვის მთლიანი თანხა. დარწმუნდით, რომ მომხმარებელი შეიყვანს დადებითი რიცხვს ასაკისა და შესყიდვის თანხისთვის. გამოიყენეთ შემდეგი ფასდაკლების წესები: 60 წელზე უფროსი ასაკის მომხმარებლებს შეუძლიათ ისარგებლონ ფასდაკლებით.
# კლიენტებს, რომლებიც ხარჯავენ $100 ან მეტს, შეუძლიათ მიიღონ ფასდაკლება. 60 წელზე უფროსი ასაკის მომხმარებლები და 100 დოლარი ან მეტი დახარჯული აქვთ უფრო მაღალი ფასდაკლების უფლება. მომხმარებლისთვის აჩვენეთ შეტყობინება, რომელშიც მითითებულია, შეუძლიათ თუ არა მას ფასდაკლება და ფასდაკლების ოდენობა, თუ ეს შესაძლებელია.


# age = int(input('Enter your age: '))

# money_spent = int(input('Enter how much you have spent: '))

# discount = (age >= 60 or money_spent > 100)

# discount2x = (age >= 60 and money_spent > 100)

# if discount2x == True:
#     print('You have 2x discount')

# if discount == True:
#     print('You have discount')

# else:
#     print("you don't have fasdakleba")


# მეორე დავალება ---

# დაწერეთ პროგრამა, რათა შეამოწმოთ, არის თუ არა სტუდენტი უფლებამოსილი სტიპენდიის მისაღებად მათი აკადემიური მოსწრებისა და ოჯახის შემოსავლის მიხედვით. სთხოვეთ მომხმარებელს შეიყვანოს თავისი GPA (საშუალო ქულა) და ოჯახის შემოსავალი. დარწმუნდით, რომ მომხმარებელი შეიყვანს დადებითრიცხვებს. გამოიყენეთ შემდეგი დასაშვებობის კრიტერიუმები: სტუდენტები GPA 3.
# 5 ან მეტი ადამიანი უფლებამოსილია სტიპენდიის მისაღებად. სტუდენტები, რომლებსაც აქვთ GPA 3.0 ან მეტი და ოჯახის შემოსავალი $50,000-ზე ნაკლები, შეუძლიათ მიიღონ უმაღლესი სტიპენდია. სტუდენტები, რომლებსაც აქვთ GPA 3.0-ზე დაბალი, არ შეუძლიათ სტიპენდიის მიღება. მომხმარებლისთვის აჩვენეთ შეტყობინება, რომელშიც მითითებულია, რამდენად შეუძლიათ სტიპენდიის მიღება და სტიპენდიის ოდენობა, თუ ეს შესაძლებელია.

# GPA = float(input('Enter your GPA: '))

# family_income = int(input('Enter your family income: '))


# scholarship = (GPA >= 3 or family_income >= 50000)

# if scholarship == True:
#     print('You have highest scholarship.')

# if scholarship == False:
#     print("You don't have scholarship, you need 50k$ for scholarship.")


# 4) მონაცემთა ტიპები


# შემოიტანეთ სხვადასხვა ცვლადები, რომლებსაც ექნებათ სხვადასხვა მონაცემთა ტიპი, შემდგომ შეამოწმეთ ეს ტიპები.

# num1 = 'hello'

# num2 = 4 > 2

# num3 = 14.64

# num4 = 2

# print(type(num1))
# print(type(num2))
# print(type(num3))
# print(type(num4))