# #1) გააკეთეთ 30 მაგალითი შედარებით ოპერატორებზე. 
# print(2 < 5)
# print(8 > 5)
# print(15 > 5)
# print(15 < 5)
# print(2 > 12)

# print(2 < 4)
# print(4 > 7)
# print(12 > 9)
# print(10 < 8)
# print(8 > 16)

# print(9 >= 3)
# print(4 <= 8)
# print(8 >= 6)
# print(5 >= 10)
# print(3 <= 5)

# print(2 <= 9)
# print(9 >= 5)
# print(8 <= 3)
# print(7 >= 8)
# print(4 <= 2)

# print(9 != 3)
# print(4 != 8)
# print(8 != 6)
# print(5 != 10)
# print(3 != 5)

# print(1 != 8)
# print(4 != 6)
# print(7 != 4)
# print(3 != 15)
# print(4 != 2)
# #2) დაწერეთ პროგრამა, რომელიც იღებს ორი ადამიანის ასაკს და განსაზღვრავს ვინ არის უფროსი.

# ნაბიჯები:

# შესთავაზეთ მომხმარებელს შეიყვანოს პირველი პირის ასაკი.
# სთხოვეთ მომხმარებელს შეიყვანოს მეორე პირის ასაკი.
# შეადარეთ ორი ასაკი შედარების ოპერატორების გამოყენებით.
# გამოიტანეთ შეტყობინება, რომელიც მიუთითებს იმაზე, თუ ვინ არის უფროსი ან იმავე ასაკის.

age1 = input("please enter your age:")
age2 = input("please enter your age:")
if age1 >= age2:
    print("Person 1 is older")
else:
    print("Person 2 is older ")
