# #1) გააკეთეთ 30 მაგალითი შედარებით ოპერატორებზე. 
# #2) დაწერეთ პროგრამა, რომელიც იღებს ორი ადამიანის ასაკს და განსაზღვრავს ვინ არის უფროსი.

# ნაბიჯები:

# შესთავაზეთ მომხმარებელს შეიყვანოს პირველი პირის ასაკი.
# სთხოვეთ მომხმარებელს შეიყვანოს მეორე პირის ასაკი.
# შეადარეთ ორი ასაკი შედარების ოპერატორების გამოყენებით.
# გამოიტანეთ შეტყობინება, რომელიც მიუთითებს იმაზე, თუ ვინ არის უფროსი ან იმავე ასაკის.

age1 = input("please enter your age:")
age2 = input("please enter your age:")
if age1 >= age2:
    print("Person 1 is older")
else:
    print("Person 2 is older ")
